app/Http/Controllers/DoctorController.php

    public function show($id)
    {
        $doctor = Doctor::findOrFail($id);
---
select * from `doctors` where `doctors`.`id` = '9' limit 1

    public function edit($id)
    {
        $doctor = Doctor::findOrFail($id);

        $specializations = Specialization::all();
---
select * from `doctors` where `doctors`.`id` = '9' limit 1
select * from `specializations`

    public function update(Request $request, $id)
    {

        $doctor = Doctor::findOrFail($id);

        $data = $request->validate([
            "name" => "required",
            "surname" => "required",
            "email" => "required|email|unique:doctors,email, " . $id,
            "address" => "required",
            "city" => "required",
            "photo" => "nullable",
            "number" => "nullable",
            "curriculum" => "nullable",
            "medicalService" => "nullable",

            "specializations" => "required"
          ]);

        // return dump($data);
        $doctor->update($data);
---
select * from `doctors` where `doctors`.`id` = '11' limit 1
update `doctors` set `medicalService` = 'prestazione 2', `doctors`.`updated_at` = '2022-04-21 07:40:26' where `id` = 11